snlkuharlocal/src/InformationRegisters/РаспределениеПлановПродажПоНакладным/РаспределениеПлановПродажПоНакладным.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспределениеПлановПродажПоНакладным</name>
  <dimensions>
    <name>ПланПродаж</name>
    <type>
      <types>DocumentRef.ПланПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РаспределениеПлановПродажПоНакладным/ManagerModule.bsl
Процедура ЗаписатьСвязкуПлановСНакладной (Знач Накладная, Знач МассивПланов) Экспорт  
	
	НаборЗаписей = РегистрыСведений.РаспределениеПлановПродажПоНакладным.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Накладная.Установить(Накладная); 
	НаборЗаписей.Прочитать(); 
	ТаблицаЗаписей = НаборЗаписей.Выгрузить();
	
	Для Каждого ТекПлан из МассивПланов Цикл   
		Если ТаблицаЗаписей.НайтиСтроки(Новый Структура("ПланПродаж, Накладная", 
			ТекПлан, Накладная)).Количество() = 0 Тогда
			
			ТекЗапись = НаборЗаписей.Добавить();    
			ТекЗапись.Накладная = Накладная;   
			ТекЗапись.ПланПродаж = ТекПлан;
			
		КонецЕсли;
	КонецЦикла;  
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры      

Функция ПолучитьОбразецПланаПоНакладной (Знач Накладная) Экспорт  
	
	Результат = Неопределено; 
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ ПЕРВЫЕ 1
	|	РС.ПланПродаж КАК ПланПродаж
	|ИЗ
	|	РегистрСведений.РаспределениеПлановПродажПоНакладным КАК РС
	|ГДЕ
	|	РС.Накладная = &Накладная";
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл   
		Результат = Выборка.ПланПродаж;
	КонецЦикла;     
	
	Возврат Результат;
	
КонецФункции
